# Microsoft SQL Server:
is a relational database management system developed by Microsoft. As a database server, it is a software product with the primary function of storing and retrieving data as requested by other software applicationsâ€”which may run either on the same computer or on another computer across a network.

#### Load modules

In [49]:
import pyodbc 
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
from IPython.display import display
#import pandas_profiling as pp
pd.options.display.max_rows = None
pd.options.display.max_columns = None

### Establishing connection

In [50]:
try:
    pd.set_option('display.max_columns', None)
    conn = pyodbc.connect('Driver={SQL Server};'
                          'Server=LAPTOP-8MGLLLEQ;'
                          'Database=python_test;'
                          'Trusted_Connection=yes;')
    cursor = conn.cursor()
    print("Connection has been established!!!!!")
    
except:
    print("------something went wrong------")

Connection has been established!!!!!

In [62]:

cursor = conn.cursor()

cursor.execute("""
                    CREATE TABLE place_test (
                    place nvarchar(50),
                    activity nvarchar(50),
                    latitude DECIMAL(8,6)  NOT NULL,
                    longitude DECIMAL(9,6)  NOT NULL
                    
                      )



""")

conn.commit()

print("Table has been created!!!")

Table has been created!!!

In [72]:
place = input("Enter Place:     ")
activity = input("Enter activity:     ")
latitude =input("Enter latutude:     ")
longitude = input("Enter longitude:     ")



cursor.execute(f"""
                    INSERT INTO place_test(place,activity,latitude,longitude)
                    VALUES
                    ('{place}','{activity}','{latitude }','{longitude}')
             



""")
conn.commit()
print("Values have been entered into the database!!")

Enter Place:     Publix Super Market At Sarasota Crossings
Enter activity:     shopping
Enter latutude:     29.616340
Enter longitude:     -98.509860
Values have been entered into the database!!

In [73]:
query = """
select * 
from [dbo].[place_test]

"""
df = pd.read_sql(query, conn)

display(df)

                                       place  activity  latitude  longitude
0                                        KHA      work  27.33729 -82.534798
1                                       Home      Home  27.34771 -82.447807
2                                Eos Fitness       Gym  27.28190 -82.531940
3  Publix Super Market At Sarasota Crossings  shopping  29.61634 -98.509860

In [65]:
df.describe()

       latitude  longitude
count   1.00000   1.000000
mean   27.33729 -82.534798
std         NaN        NaN
min    27.33729 -82.534798
25%    27.33729 -82.534798
50%    27.33729 -82.534798
75%    27.33729 -82.534798
max    27.33729 -82.534798

#### Converting data into json

In [66]:
print(df.to_json(orient ='index'))

{"0":{"place":"KHA","activity":"work","latitude":27.33729,"longitude":-82.534798}}

# Make sure you close your connection.
If we don't close the connection, it will lead to connection memory leakage. Unless/until application server/web server is shut down, connection will remain activate even though the user logs out.

There are additional reasons. Suppose database server has 10 connections available and 10 clients request for the connection. If the database sever grants all of them, and after their usage they are not closed, the database server would not be able to provide a connections for another request. For that reason we need to close them - it is mandatory.

Furthermore, it might lead to some mischievous activities regarding the integrity of the database. https://stackoverflow.com/questions/25864235/why-we-should-close-the-connection-in-jdbc-if-we-dont-do-it-what-will-happen

In [48]:
cursor = conn.cursor()
cursor.close()
print("Connection has been closed!!")

Connection has been closed!!